[{"Title":"Assises du Hainaut : Eric Guisset est accusé de l’assassinat de sa compagne, Engie Boucq, à Antoing","Date":1743401700000,"Day":31.0,"Month":3.0,"Year":2025.0,"Hour":"06:15","URL":"https:\/\/www.rtbf.be\/article\/assises-du-hainaut-eric-guisset-est-accuse-de-l-assassinat-de-sa-compagne-engie-boucq-a-antoing-11525865","Description_all":"C’est le procès d’une personne accusée de féminicide qui s’ouvre ce lundi à 9h00 devant la Cour d’Assises du...","Description":"C’est le procès d’une personne accusée de féminicide qui s’ouvre ce lundi à 9h00 devant","Feed":"RTBF - Local"},{"Title":"Le procès de Steve Chevalier s’ouvre ce lundi 31 mars 2025 devant la cour d’assises à Arlon","Date":1743393540000,"Day":31.0,"Month":3.0,"Year":2025.0,"Hour":"03:59","URL":"https:\/\/www.lavenir.net\/regions\/luxembourg\/virton\/2025\/03\/31\/le-proces-de-steve-chevalier-souvre-ce-lundi-devant-la-cour-dassises-a-arlon-ENPYTGQP25CVPDQ5KMKFKSUEJ4\/","Description_all":"La journée de lundi sera consacrée à la lecture de l’acte d’accusation et à l’interrogatoire de l’accusé. Steve Chevalier est accusé de l’assassinat de Dominique Meyer, le 11 décembre 2022 à Virton. Le corps calciné de la victime avait été retrouvé à la suite de l'incendie de son appartement. ...","Description":"La journée de lundi sera consacrée à la lecture de l’acte d’accusation et à l’interrogatoire","Feed":"L'Avenir - Luxembourg"},{"Title":"La police lance une avis de recherche 31 ans après la découverte d'une femme inconnue retrouvée dans une citerne d'eau de pluie à Holsbeek","Date":1682812800000,"Day":30.0,"Month":4.0,"Year":2023.0,"Hour":0,"URL":"https:\/\/www.lavenir.net\/actu\/societe\/faitsdivers\/2023\/04\/30\/la-police-lance-une-avis-de-recherche-31-ans-apres-la-decouverte-dune-femme-inconnue-retrouvee-dans-une-citerne-deau-de-pluie-a-holsbeek-X5KQOFIXMZFJPLNLRNXSBVTOZE\/","Description_all":"Ce dimanche 30 avril 2023, à la requête du parquet de Louvain, la police diffuse un avis de recherche concernant une femme dont le corps a été retrouvé dans une citerne d'eau de pluie à Holsbeek. Le 06 août 1991 environ 19h00, le corps d'une femme a été retrouvé dans une citerne d'eau de pluie appartenant à un chalet situé Attenhovendreef à Holsbeek. Le corps pourrait avoir séjourné deux années. A ce jour, l'identité de cette femme reste inconnue.Elle est âgée entre 30 à 55 ans et est de petite taille (1m54).Elle a une dentition peu soignée. Elle portait vraisemblablement une prothèse dentaire à la mâchoire supérieure vu que les dents étaient manquantes. De nombreux plombages dentaires étaient présents à la mâchoire inférieure.Elle portait un gilet tricoté beige\/brun muni d'une ceinture, un T-shirt avec des rayures verticales noires et la représentation de 2 surfeurs et 3 palmiers colorés ainsi que les inscriptions \"Sun- Surf- Sea\", un short à carreaux foncés muni d'un logo brun et carré sur le côté droit représentant un lion avec une couronne. Au majeur droit, elle portait une bague en plastique ou en corne.Si vous reconnaissez ces vêtements ou si vous connaissez cette dame, veuillez prendre contact avec les enquêteurs via avisderecherche@police.belgium.eu.Les témoignages peuvent aussi parvenir via le numéro gratuit 0800 30 300.","Description":"Ce dimanche 30 avril 2023, à la requête du parquet de Louvain, la police diffuse un avis de recherche concernant une femme dont le corps a été retrouvé dans une citerne d'eau de pluie à Holsbeek.","Feed":"AVENIR"},{"Title":"Cambriolage meurtrier à Woluwe-Saint-Pierre: le CEO de Goodyear Europe découvre le corps de sa femme sans vie","Date":1743234360000,"Day":29.0,"Month":3.0,"Year":2025.0,"Hour":"07:46","URL":"https:\/\/www.7sur7.be\/faits-divers\/cambriolage-meurtrier-a-woluwe-saint-pierre-le-ceo-de-goodyear-europe-decouvre-le-corps-de-sa-femme-sans-vie~aba815f7\/","Description_all":"Une femme de 61 ans a été tuée le 17 mars lors du cambriolage de son appartement à Woluwe-Saint-Pierre, a indiqué samedi le parquet de Bruxelles, confirmant une information de Sudinfo et Het Nieuwsblad. Selon les deux médias, la victime serait l’épouse du président du fabricant de pneu Goodyear Europe.","Description":"Une femme de 61 ans a été tuée le 17 mars lors du cambriolage de","Feed":"7sur7 : faits-divers"},{"Title":"Cambriolage meurtrier à Woluwe-Saint-Pierre: un patron du fabricant de pneus Goodyear découvre sa femme poignardée \n","Date":1743206400000,"Day":29.0,"Month":3.0,"Year":2025.0,"Hour":0,"URL":"https:\/\/www.rtl.be\/actu\/belgique\/faits-divers\/cambriolage-meurtrier-woluwe-saint-pierre-un-patron-du-fabricant-de-pneus\/2025-03-29\/article\/744315","Description_all":"L'épouse du président \"Moyen-Orient, Afrique, Europe\" du fabricant de pneus Goodyear a été tuée lundi 17 mars dans leur appartement de Woluwe-Saint-Pierre lors d’un cambriolage, a révélé Sudinfo. L’auteur des faits, toujours en fuite, aurait passé près d’une heure sur place avant de repartir avec des objets de valeur.\n L'épouse du président \"Moyen-Orient, Afrique, Europe\" du fabricant de pneus Goodyear a été tuée lundi 17 mars dans leur appartement de Woluwe-Saint-Pierre lors d’un cambriolage, a révélé Sudinfo. L’auteur des faits, toujours en fuite, aurait passé près d’une heure sur place avant de repartir avec des objets de valeur.. Lundi 17 mars, aux alentours de 20 heures, Carmel D., président \"Moyen-Orient, Afrique, Europe\" du fabricant de pneu Goodyear, s’apprête à entrer dans son appartement situé avenue Roger Vandendriessche, à Woluwe-Saint-Pierre. Un homme l'attendait.Il la menace d'un couteau en l'obligeant à entrer dans son appartement. Il s'agit pourtant d'un immeuble très sécurisé, avec des caméras et des alarmes. Le cambrioleur entre finalement de force et ne s'arrête pas là : il va la frapper à quatre reprises avec un couteau et procéder ensuite à un cambriolage. À lire aussi Double homicide à Marcinelle: les victimes ont été retrouvées poignardées dans un appartement. L’agresseur serait resté dans le logement pendant près d’une heure, fouillant les lieux à la recherche d’objets de valeur. Il a finalement pris la fuite avec des montres de luxe, d'une valeur totale de plusieurs dizaines de milliers d'euros, et des bijoux. C’est son mari qui a fait la macabre découverte en rentrant chez lui plus tard dans la soirée. Il a immédiatement appelé les services de secours, qui n'ont pu que constater le décès.Le meurtrier toujours recherché\"Le parquet a désigné un juge d'instruction pour des faits d'homicide\", a précisé le parquet de Bruxelles. À ce stade, l’auteur du crime n’a pas été identifié et reste en fuite. Les enquêteurs poursuivent leurs investigations pour retrouver le suspect et déterminer les circonstances exactes du drame.. \"Dans l'intérêt de l'enquête et par respect pour la famille de la victime, aucun autre commentaire ne sera fait\".Le corps de Carmel D., âgée de 61 ans et originaire de New York, a été rapatrié aux États-Unis, où elle sera inhumée mercredi. Elle laisse derrière elle quatre enfants et deux petits-enfants.\"On a une attention particulière\"Le bourgmestre de la Woluwe-Saint-Pierre, Benoît Cerexhe assure que c'est \"la première fois\" qu'il est confronté \"à ce type de phénomène\". Il s'agit, selon lui, d'une attaque \"qui a été préparée\", bien que l'enquête devra déterminer la vérité sur cette affaire.\"Globalement, les statistiques de criminalité sont excellentes sur le territoire de Woluwe-Saint-Pierre, même si un délit est toujours un délit de trop, puisqu'on a vu que cette criminalité a diminué de plus de 30% entre l'hiver 2023 et l'hiver 2024. Mais il est clair qu'on a une attention particulière, parce qu'on a vu que dans ce quartier Saint-Michel\/Chant d'Oiseau, ces dernières semaines, on avait une petite croissance des vols, des cambriolages et donc la sécurité a été renforcée\", rassure le bourgmestre","Description":"L'épouse du président \"Moyen-Orient, Afrique, Europe\" du fabricant de pneus Goodyear a été tuée lundi 17 mars dans leur appartement de Woluwe-Saint-Pierre lors d’un cambriolage, a révélé Sudinfo. L’auteur des faits, toujours en fuite, aurait passé près d’une heure sur place avant de repartir avec des objets de valeur.\n","Feed":"RTL"},{"Title":"Ismaël a avoué avoir tué et démembré sa maman dans son appartement de Jemeppe","Date":1690502400000,"Day":28.0,"Month":7.0,"Year":2023.0,"Hour":0,"URL":"https:\/\/www.lavenir.net\/regions\/liege\/2023\/07\/28\/maria-tuee-demembree-et-jetee-dans-le-canal-albert-son-fils-est-passe-aux-aveux-UPCLUOUMXJGLNHTSLDNO5ZLW5M\/","Description_all":"L'homme a expliqué avoir eu un coup de sang lassé d'être sans cesse humilié. Il a été placé sous mandat d'arrêt. Les habitants de la rue Grand-Vinâve à Jemeppe (Seraing) sont encore sous le choc. C'est là en effet que Maria Verdoolaege (74 ans) habitait avec son fils et sa petite fille.Une partie du corps de la septuagénaire, ses quatre membres et la scie qui a servi à le démembrer, a été retrouvée, mercredi, dans un frigo flottant sur les eaux du Canal Albert à Oupeye alors que les policiers ont retrouvé son tronc et sa tête dans un conteneur à puce qui lui, se trouvait encore en Meuse à hauteur de Wandre. Selon toute probabilité, les deux contenants auraient été jetés en amont dans la Meuse, au même moment, l'un se déplaçant plus vite que l'autre.+ LIRE | Bras et jambes humains retrouvés dans un frigo flottant sur le Canal Albert : un suspect interpellé aurait assassiné sa mamanEn vacances avec une amieAu moment de la découverte du frigo, les policiers ont pensé avoir un dossier compliqué à traiter. Mais finalement il ne leur a fallu que quelques jours pour le résoudre. Il faut écrire qu'un témoignage pour le moins interpellant est revenu à leurs oreilles. Un homme, certes imbibé d'alcool avait téléphoné à la police pour dire qu'un de ses amis avait reçu les confidences d'une tierce personne qui avait affirmé avoir tué sa maman, avant de la démembrer ! Si le témoignage n'avait pas été pris fort au sérieux, il a évidemment retrouvé du crédit au moment de la découverte. Puis, lorsque les policiers ont scruté la Meuse et retrouvé un conteneur à puce abritant le reste du corps de Maria, il s'est avéré que la puce du conteneur a mené les policiers jusqu'à son propriétaire, un homme habitant Jemeppe et voisin de Maria.Si l'homme a été mis hors de cause, la mort même de Maria n'était pas établie. C'est que des voisins, la famille Ismaël le premier avaient pour certitude que Maria était en fait en vacances. \"On nous a dit qu'elle était partie au Cameroun avec une amie. On ne s'est pas inquiété\", raconte ainsi une connaissance de Maria.Interrogée, une voisine a dit la même chose aux policiers. \"En plus de cela, personne dans la famille n'avait l'air inquiet\", reprend une autre amie qui demeure non loin de la maison de Maria. \"Mais c'est vrai que Maria avait des difficultés avec son fils. Elle m'avait dit une fois qu'elle avait des problèmes avec Ismaël. Il squattait sa chambre et elle devait aller dormir ailleurs dans la maison. Elle ne voulait plus que cela dure. J'ai même une fois entendu des cris de dispute, mais je ne sais pas avec qui Maria se disputait.\"La brimade de trop ?L'étau se resserrait donc sur Ismaël et ce, d'autant plus qu'il était introuvable. Des moyens d'enquête ont toutefois permis de le localiser alors qu'il se trouvait dans un hôtel non loin de l'aéroport de Zaventem. Il devait s'envoler quelques heures plus tard vers la Corée.Interrogé longuement pas les enquêteurs. Ismaël est rapidement passé aux aveux d'avoir tué et démembré sa maman. L'homme a ainsi expliqué qu'il était brimé et humilié par sa mère depuis sa plus tendre enfance. Le 10 juillet mère et fils se sont à nouveau disputés et là, comme l'explique Ismaël, le fils a eu un coup de sang. Il s'est jeté sur sa mère et l'a étranglée. Puis se rendant compte de ce qu'il venait de faire et ne voulant pas être pris, il s'est emparé d'une scie, a découpé sa maman, a placé les membres et la scie dans un petit frigo, a volé le conteneur à puce du voisin pour y placer le torse et la tête. Il a finalement emmené le tout en bord de Meuse, à Jemeppe pour y jeter les deux contenants.Entendu par le juge d'instruction Doyen, Ismaël a été placé sous mandat d'arrêt pour meurtre et écroué à la prison de Lantin.Pour accéder à cet article, veuillez vous connecter au réseau internet.","Description":"L'homme a expliqué avoir eu un coup de sang lassé d'être sans cesse humilié. Il a été placé sous mandat d'arrêt.","Feed":"AVENIR"},{"Title":"Deux ans de prison ferme pour avoir porté des coups à sa compagne : il avait été impliqué dans un drame mortel à Thieu","Date":1743120000000,"Day":28.0,"Month":3.0,"Year":2025.0,"Hour":0,"URL":"https:\/\/www.dhnet.be\/regions\/centre\/2025\/03\/28\/deux-ans-de-prison-ferme-pour-avoir-porte-des-coups-a-sa-compagne-il-avait-ete-implique-dans-un-drame-mortel-a-thieu-RNINLAP565A4DFR4S2S4K5I3ZE\/","Description_all":"L'homme s'est montré, une nouvelle fois, violent avec celle qui partageait sa vie et qui a fui à l'étranger pour ne plus le croiser. Le tribunal correctionnel a prononcé, vendredi, une peine de deux ans de prison ferme et une amende de 400 euros contre Bruno, poursuivi pour plusieurs scènes de violence, en état de récidive.Bruno a écopé de six ans de prison en 2013 pour une tentative d'homicide à Bruxelles. Le 29 janvier 2019, il s'était disputé avec sa compagne alors qu'ils circulaient sur l'autoroute E42. Il s'est arrêté le long de la voie rapide à hauteur de Thieu. Cécilia est sortie de l'auto et a traversé la route, mortellement percutée par plusieurs véhicules. Bruno a pris la fuite. Le tribunal l'avait condamné à 40 mois de prison, avec sursis pour ce qui excède 12 mois de prison, pour homicide involontaire.À lire aussiDeux hommes surpris en train de commettre un vol dans une librairie à La Louvière durant la nuit : ils sortaient un coffre-fort à la brouetteCette fois, le ministère public lui reprochait trois scènes de violence.Les faitsLe 23 février 2023, une jeune femme appelle la police pour dénoncer une agression dont elle est victime. Les policiers arrivent et remarquent que le pull blanc de l'appelante est couvert d'hémoglobine. Ses cheveux sont couverts de sang, elle a une plaie de quatre à cinq centimètres à l'arrière du crâne. Les policiers relèvent aussi des traces de strangulation et des griffures. Elle va d'abord dénoncer son compagnon, Bruno, avant de se rétracter et de dire que l'auteur est son dealer.Le 13 août 2023, cette jeune femme appelle sa sœur, laquelle vient la chercher et dépose plainte contre son beau-frère. Les lésions sont décrites par un médecin sur un rapport médical.Cette femme, jadis sous emprise selon son avocate, a fui à l'étranger. Me Valentine Crombez raconte qu'elle ne souhaite pas donner l'adresse de sa cliente, laquelle craint des représailles.À lire aussiCécilia tuée sur l'E42 à Thieu : le tribunal condamne le compagnon à une peine avec sursis. Pour le tribunal, la mort est la conséquence d'un accidentEn avril 2023, Bruno traverse un passage piéton. Il est ivre et frappe la carrosserie d'une voiture dans laquelle se trouvent un homme et son fils âgé de huit ans. L'automobiliste sort et reçoit un violent coup dans la figure. Bruno embarque dans une Opel conduite par sa compagne et file.Bruno est détenu sous surveillance électronique jusqu'en août. Si celle-ci se prolonge, il ne devrait pas faire appel.","Description":"L'homme s'est montré, une nouvelle fois, violent avec celle qui partageait sa vie et qui a fui à l'étranger pour ne plus le croiser.","Feed":"DH"},{"Title":"Crime à Antoing : Après avoir poignardé Engie, à une dizaine de reprises, Eric est allé au bistrot pour profiter d'une dernière soirée de liberté","Date":1743120000000,"Day":28.0,"Month":3.0,"Year":2025.0,"Hour":0,"URL":"https:\/\/www.dhnet.be\/regions\/tournai-ath-mouscron\/2025\/03\/28\/crime-a-antoing-apres-avoir-poignarde-engie-a-une-dizaine-de-reprises-eric-est-alle-au-bistrot-pour-profiter-dune-derniere-soiree-de-liberte-VOALG7T34BAXHHBES3TPWBMW7Y\/","Description_all":"Eric Guisset doit répondre de l'assassinat d'Engie Boucq, sa compagne, commis à la rue Joly à Antoing, le 4 août 2023. Nous sommes le 4 août 2023. Il est 16h01 quand Eric Guisset (54 ans) avoue à sa cousine, par téléphone, qu'il a planté sa compagne, Engie Boucq (42 ans), de plusieurs coups de couteau. Il lui annonce qu'il est en train de boire un verre dans un café en attendant les policiers qui iront le conduire \"à la taule\".La cousine annonce qu'elle va appeler la police. Eric répond : \"Non, ne fais pas ça, je ne vais pas pouvoir profiter de ma dernière soirée\". À 16h24, la cousine appelle la police pour leur indiquer qu'un crime a été commis dans une habitation de la rue Joly, à Antoing.Elle respire encoreUne patrouille de la zone de police du Tournaisis est sur les lieux six minutes plus tard. Les policiers entrent dans l'habitation par l'arrière du bâtiment, où se trouve la cuisine. Ils constatent des traces de pieds ensanglantés qui les emmènent au salon, et la présence d'un couteau dont la lame est couverte d'hémoglobine, dans l'évier.À lire aussiLogan est condamné à trois ans de prison avec sursis pour avoir poignardé son frère Kevin, originaire de Quaregnon, à BincheIls arrivent dans le salon et découvrent le corps d'Engie. Elle est couchée sur le dos, sous une couette. Il y a une grande quantité de sang sur le sol et la victime présente plusieurs plaies au niveau du thorax. Elle a été frappée à une dizaine de reprises et plusieurs organes vitaux sont touchés.Engie respire encore. Pendant une heure, les services de secours tentent de la sauver sur place. Elle décède à l'hôpital, quelques heures plus tard.Il boit son pastisLa police se lance à la recherche d'Eric Guisset dans les cafés du coin. Il est passé dans des cafés où il a annoncé qu'il allait boire ses derniers verres avant d'être arrêté. Les policiers le trouvent dans un débit de boissons, accoudé au bar, en train de boire du pastis et du vin rosé en compagnie d'une cliente. Il s'emporte et refuse de se laisser fouiller. Il est 16h47 quand il est privé de liberté.Eric Guisset doit répondre d'un assassinat devant la cour d'assises du Hainaut. Il a donc, selon le parquet général, prémédité son crime. Ce n'est pas un coup de folie, instantané, mais un acte mûrement réfléchi. Le 2 août, Engie Boucq a appelé la police. Eric, à qui elle a demandé son domicile en raison de son comportement agressif et violent, l'aurait menacé de la planter avec un couteau. Il l'aurait encore menacée de mort le lendemain. Enfin, le jour des faits, en matinée, Engie Boucq avait appelé la police pour dénoncer de nouvelles menaces. Une plainte avait été actée.Le procès débute lundiLundi, Eric Guisset sera interrogé par Martine Baes, présidente de cette session d'assises. Le juge d'instruction, les policiers et les premiers experts judiciaires sont attendus lundi après-midi. Viendront ensuite les témoins directs des faits et les témoins de moralité.À travers l'acte d'accusation, on apprend que le couple s'était rencontré lors d'une cure de désintoxication. Le jour des faits, ils étaient tous deux sous influence de l'alcool.Le procès est prévu pour une semaine. L'avocat général François Demoulin représente le parquet général.Me Jérémie Berger et Me Clémentine Pary, du barreau de Mons, défendent l'accusé.À lire aussiIl parcourt 600 km pour contester le viol d'une jeune femme sur un parking à Mons, après une soirée au bowlingLes parties civiles sont représentées par Me Nicolas Devaux, du barreau de Namur, Me Guillaume Gossiaux et Me Gauthier Gossiaux, du barreau de Tournai.Jeudi, six hommes et six femmes ont été tirés au sort pour former le jury. Deux femmes seront jurées suppléantes.","Description":"Eric Guisset doit répondre de l'assassinat d'Engie Boucq, sa compagne, commis à la rue Joly à Antoing, le 4 août 2023.","Feed":"DH"},{"Title":"Macabre découverte à Oupeye: les bras et les jambes d'une dame découverts dans un frigo sur le canal Albert","Date":1690329600000,"Day":26.0,"Month":7.0,"Year":2023.0,"Hour":0,"URL":"https:\/\/www.lavenir.net\/regions\/liege\/2023\/07\/26\/les-bras-et-les-jambes-dune-dame-decouverts-dans-un-frigo-sur-le-canal-albert-a-oupeye-JVHGGVIZ7BEUVDT7E23OLU7OGE\/","Description_all":"Le parquet de Liège indique, ce mercredi 26 juillet 2023, que les bras et les jambes d'une femme ont été découverts la veille dans un frigo qui flottait sur le canal Albert à hauteur d'Hermalle-sous-Argenteau (Oupeye). Les bras et les jambes d'une femme ont été découverts mardi dans un frigo qui flottait sur le canal Albert à hauteur d'Hermalle-sous-Argenteau (Oupeye), indique le parquet de Liège, confirmant une information de Sudinfo, ce mercredi matin.La découverte a été faite mardi par un témoin interpellé par le réfrigérateur flottant. Il l'a ramené à la berge et s'est rendu compte qu'une forte odeur s'en dégageait. Le témoin a alors contacté la police, qui a ouvert le frigo et a découvert les quatre membres d'une femme.Un médecin légiste, le laboratoire et le service d'identification des victimes (DIV) se sont rendus mardi sur les lieux de la découverte.D'après les premières constatations, il s'agit des bras et des jambes d'une même personne.Une enquête a été ouverte et confiée à la Police judiciaire fédérale (PJF) de Liège.","Description":"\nLe parquet de Liège indique, ce mercredi 26 juillet 2023, que les bras et les jambes d'une femme ont été découverts la veille dans un frigo qui flottait sur le canal Albert à hauteur d'Hermalle-sous-Argenteau (Oupeye).","Feed":"AVENIR"},{"Title":"Au procès du meurtre de Chahinez Daoud, brûlée vive, l’accusé crie au complot: “Ma femme avait un plan diabolique”","Date":1742914500000,"Day":25.0,"Month":3.0,"Year":2025.0,"Hour":"14:55","URL":"https:\/\/www.7sur7.be\/monde\/au-proces-du-meurtre-de-chahinez-daoud-brulee-vive-laccuse-crie-au-complot-ma-femme-avait-un-plan-diabolique~ad996976\/","Description_all":"Quatre ans après le féminicide retentissant de Chahinez Daoud, brûlée vive à Mérignac en Gironde, le procès de son ex-mari pour assassinat s’est ouvert lundi à Bordeaux, l’accusé se décrivant comme un “gentleman” et se disant victime d’un complot ourdi pour le “détruire”.","Description":"Quatre ans après le féminicide retentissant de Chahinez Daoud, brûlée vive à Mérignac en Gironde,","Feed":"7sur7 : faits-divers"},{"Title":"Un jury en majorité masculin pour juger Sergio Siciliana, accusé du meurtre de sa compagne","Date":1708819200000,"Day":25.0,"Month":2.0,"Year":2024.0,"Hour":0,"URL":"https:\/\/www.lavenir.net\/regions\/charleroi\/charleroi\/2024\/02\/25\/un-jury-en-majorite-masculin-pour-juger-sergio-siciliana-accuse-du-meurtre-de-sa-compagne-NTIP6D24OBDLFJLEXDYI6AVRAU\/","Description_all":"L'homme est accusé du meurtre de sa compagne. Le procès commencera le 11 mars. Huit hommes et quatre femmes ont été tirés au sort pour siéger dans le jury chargé de juger Sergio Siciliano. Cet homme de 54 ans est accusé du meurtre de Lucia Valentini, sa compagne. Son procès commencera le 11 mars devant la cour d'assises de Hainaut. Outre les 12 jurés effectifs, trois hommes et une femme endosseront le rôle de jurés suppléants.Sergio Siciliano est accusé du meurtre de Lucia Valentini, commis la nuit du 18 au 19 février 2022, dans un immeuble de la rue de la Station à Jumet. La victime a été frappée de plusieurs coups de couteau. Les médecins légistes ont relevé 34 plaies sur le torse de la victime, dont 11 ont atteint des organes vitaux.C'est l'accusé qui a appelé les secours, le 19 février 2022 au matin, mais il était trop tard.L'accusé et la victime, tous deux quinquagénaires, étaient en couple depuis une dizaine de jours.Sergio Siciliano était déjà connu des autorités judiciaires pour des faits de violence et de harcèlement envers plusieurs anciennes compagnes.Ce procès devrait durer une semaine. Il sera présidé par Adrien Van der Linden d'Hoogvoorst. L'avocat général François Demoulin représentera l'accusation, tandis que la défense du quinquagénaire sera assurée par Mes Ricardo Bruno et Salvatore Callari, du barreau de Charleroi.Pour accéder à cet article, veuillez vous connecter au réseau internet.","Description":"L'homme est accusé du meurtre de sa compagne. Le procès commencera le 11 mars.","Feed":"AVENIR"},{"Title":"\"J’ai perdu mon sang-froid, le coup est parti\": en Belgique, une vingtaine de féminicides sont recensés chaque année \n","Date":1742154120000,"Day":16.0,"Month":3.0,"Year":2025.0,"Hour":19.0,"URL":"https:\/\/www.rtl.be\/actu\/belgique\/faits-divers\/jai-perdu-mon-sang-froid-le-coup-est-parti-en-belgique-une-vingtaine-de\/2025-02-13\/article\/739232","Description_all":"Le procès de David Piton s'est ouvert cette semaine à la cour d'assises de Liège. Il est accusé d'avoir tué son ex-compagne, Madisson Hamoir, mère de leurs deux enfants, d'une balle dans la tête. \n Le procès de David Piton s'est ouvert cette semaine à la cour d'assises de Liège. Il est accusé d'avoir tué son ex-compagne, Madisson Hamoir, mère de leurs deux enfants, d'une balle dans la tête.. David Piton, un Sprimontois âgé de 34 ans, est accusé d'avoir tué son ex-compagne. Lors de l’ouverture de son procès, il a tenté d’expliquer son geste : \"J’ai perdu mon sang-froid. Le coup est parti\", a déclaré l'homme devant les jurés. À lire aussi Aline Dirkx, coordinatrice pour Mirabal: \"Nous en sommes à, au moins, 21 féminicides en 2024 en Belgique\" Mais pour l’avocat des parties civiles, Me Renaud Molders-Pierre, ce crime ne peut se résumer à un simple \"accident\". \"Il y a effectivement une jalousie qui s’est installée\", explique-t-il. Avant d'ajouter: \"Une jalousie et une possessivité qui ont engendré le fait que l’accusé surveillait sa future victime\".. Selon lui, l’un des enjeux du procès sera de comprendre comment David Piton en est arrivé à tuer son ex-compagne.Le féminicide, un phénomène encore mal identifiéLe féminicide est défini comme le meurtre d'une femme en raison de son appartenance au sexe féminin. En Belgique, plus d’une vingtaine de cas sont recensés chaque année, mais les spécialistes estiment que ce chiffre est largement sous-estimé.“Il y a des féminicides non-intimes, comme ceux liés à l’exploitation sexuelle ou au trafic d’êtres humains, mais aussi des féminicides indirects, comme les suicides résultant de violences conjugales”, précise l’avocate spécialisée en droits humains, Sibylle Gioe. À lire aussi Il avait poignardé à mort sa petite amie: la perpétuité pour l'auteur d'un féminicide qui a bouleversé l'Italie En 2023, elle a contribué à la rédaction de la loi \"STOP Féminicide\", qui a été adoptée en Belgique. Ce texte est une première en Europe, car il intègre officiellement le féminicide dans un cadre légal. Son objectif principal est préventif.. Une loi symbolique, mais peu contraignanteLa loi \"STOP Féminicide\" définit plusieurs formes de violences de genre : Physiques Psychologiques Sexuelles Économiques Liées au contrôle coercitif, notamment dans le cadre familial ou conjugal. Toutefois, cette législation n'a pas été intégrée au Code pénal belge. Une décision justifiée par certains avocats pénalistes : \"La peine qui est déjà prévue est la plus lourde. D’un point de vue purement juridique, il n’y a donc pas de nécessité à ajouter des circonstances aggravantes\", estime Me Nathan Mallants. À lire aussi Le corps d'une quadragénaire découvert à Herentals: un nouveau féminicide dans le pays? Me Adrien Croisier partage cet avis : \"Au moment de la répression, c’est de toute façon trop tard. Et en l’état actuel de la législation, on peut déjà aller jusqu’à la peine maximale\".Une mise en application encore incertaineSi cette loi ne vise pas à renforcer les sanctions pénales, elle a pour but d’améliorer l’identification des féminicides et de mieux adapter les politiques publiques. Mais encore faut-il que ces mesures soient mises en œuvre...“Cette loi a été votée à l’unanimité, sauf l’abstention de la N-VA, qui est aujourd’hui au gouvernement fédéral”, rappelle Sibylle Gioe. À lire aussi \"Il m'a étranglée avec une corde\": Farida a survécu à une tentative de féminicide, un fléau de plus en plus médiatisé au Maghreb, mais… L'accord du gouvernement fédéral prévoit une dizaine de mesures pour lutter contre les féminicides. Leur mise en place dépendra toutefois des moyens alloués à la Justice belge. Pour l’instant, les associations et les familles de victimes attendent encore des actions concrètes","Description":"Le procès de David Piton s'est ouvert cette semaine à la cour d'assises de Liège. Il est accusé d'avoir tué son ex-compagne, Madisson Hamoir, mère de leurs deux enfants, d'une balle dans la tête. \n","Feed":"RTL"},{"Title":"L'un des suspects aurait avoué avoir tué Heidi De Schepper, disparue en 2010: il était déjà connu pour une sordide affaire \n","Date":1742154120000,"Day":16.0,"Month":3.0,"Year":2025.0,"Hour":19.0,"URL":"https:\/\/www.rtl.be\/actu\/belgique\/faits-divers\/lun-des-suspects-aurait-avoue-avoir-tue-heidi-de-schepper-disparue-en-2010-il\/2025-02-28\/article\/740868","Description_all":"Depuis 2010, Heidi De Schepper, à l’époque âgée de 26 ans, est portée disparue. Pourtant, la police ne s'en est aperçue que l'année dernière. Durant toutes ces années, personne n'avait signalé la disparition de la jeune femme.\n Depuis 2010, Heidi De Schepper, à l’époque âgée de 26 ans, est portée disparue. Pourtant, la police ne s'en est aperçue que l'année dernière. Durant toutes ces années, personne n'avait signalé la disparition de la jeune femme.. Les opérations de recherche lancées vendredi à Balen et visant à retrouver le corps de Heidi De Schepper, disparue en 2010, ont été interrompues sans résultats, a indiqué le parquet d'Anvers. Entre-temps, les trois suspects interpellés jeudi ont été placés sous mandat d'arrêt.D'après Het Laatste Nieuws, Nick G. (33 ans) a avoué avoir tué Heidi De Schepper.L'homme aurait déclaré l'avoir tuée à la demande de son partenaire de l'époque, rapportent encore nos confrères. Il aurait également montré aux enquêteurs l'endroits où la victime a été enterrée avec un troisième ami.. Ni le parquet, ni son avocat n'ont toutefois confirmé cette information. Le ministère public a en revanche indiqué qu'une perquisition avait été menée vendredi sur base d'éléments révélés lors du premier interrogatoire de l'homme.Nick G., 33 ans, était déjà connu de la justice. En 2013, il a été condamné à 23 ans de prison pour un crime particulièrement violent: l’assassinat de son meilleur ami, Glenn. Armé d’une hache achetée la veille, il lui avait porté plusieurs coups à la tête dans un bois de Balen.Ce soir-là, Nick G. avait convoqué Glenn pour une confrontation. Il le soupçonnait d’avoir une liaison avec son ex-petite amie.. Libéré en 2021 après avoir purgé dix ans de sa peine, Nick G. fait donc à nouveau parler de lui. Ce jeudi matin, il a été interpellé à son domicile et placé en garde à vue dans le cadre de l’enquête sur la disparition de Heidi De Schepper. Selon les enquêteurs, il entretenait des contacts fréquents avec Nick M., déjà impliqué dans l’affaire, à l’époque des faits. Trois personnes arrêtées Trois suspects ont été arrêtés ce jeudi : Nick M. (55 ans), alors partenaire et père de ses enfants, et deux de ses amis. Nick G. (33), a déjà été reconnu coupable de meurtre. Il a été arrêté et était soupçonné du meurtre d'Heidi.Heidi De Schepper, 26 ans, a soudainement disparu en 2010, mais personne n'a jamais signalé sa disparition. Son partenaire de l'époque, Nick M., avait déclaré à la police qu'il n'avait plus jamais revu Heidi. Il a élevé seul ses trois enfants. À lire aussi \"Elle était une mère parfaite mais...\": l'ex-compagnon d'Heidi, qui a disparu il y a 14 ans, sort du silence Jeudi, il a été arrêté avec deux autres personnes, soupçonnées du meurtre de la jeune femme. Leur rôle précis reste à clarifier, mais jusqu'à présent, un seul suspect a été interrogé : Nick G. de Balen. Le juge d'instruction l'a arrêté pour meurtre.Deux ans après la disparition d'Heidi, Nick G. a été reconnu coupable d'un meurtre à la hache, pour lequel il a été condamné à 23 ans de prison. Les deux autres suspects, son ancien partenaire et un ami de 39 ans, seront interrogés ce vendredi sur leur rôle précis dans l'affaire.","Description":"Depuis 2010, Heidi De Schepper, à l’époque âgée de 26 ans, est portée disparue. Pourtant, la police ne s'en est aperçue que l'année dernière. Durant toutes ces années, personne n'avait signalé la disparition de la jeune femme.\n","Feed":"RTL"},{"Title":"100 noms de femmes tuées parce qu'elles étaient femmes sur la première stèle aux victimes de féminicide de Bruxelles, place Marie Janson à Saint-Gilles","Date":1742154120000,"Day":16.0,"Month":3.0,"Year":2025.0,"Hour":19.0,"URL":"https:\/\/www.lavenir.net\/regions\/bruxelles\/saint-gilles\/2025\/03\/06\/100-noms-de-femmes-tuees-parce-quelles-etaient-femmes-sur-la-premiere-stele-aux-victimes-de-feminicide-de-bruxelles-place-marie-janson-a-saint-gilles-DVJJCZQF6VHJ5ION6DT4UZDCQA\/","Description_all":"C'est une première à Bruxelles : une stèle en mémoire des victimes de féminicides va être installée à Saint-Gilles. Nathalie, Sara, Néva… : elle porte les noms de 100 femmes. Céline Delbecq, son initiatrice, raconte la genèse de ce monument et son travail pour visibiliser les féminicides. \"Ils relèvent d'une responsabilité sociétale, et pas familiale\". Il y a eu \"au moins\" 23 féminicides en 2024 en Belgique. Et \"au moins\" 26 en 2023. Ce sont les chiffres de Stop Féminicide, le blog qui recense \"les femmes qui sont tuées parce qu'elles sont femmes\". Selon cette plateforme, le macabre décompte se chiffre déjà à 3 en 2025.La première stèle à la mémoire des femmes victimes de féminicides de Bruxelles sera inaugurée ce samedi 8 mars 2025 à la place Marie Janson à Saint-Gilles. L'initiative en revient à l'autrice et comédienne Céline Delbecq, fondatrice de la Compagnie de la Bête Noire.Céline Delbecq, d'où vient cette idée de stèle ?Du texte d'un spectacle que j'ai écrit : \"Cinglée\". Ça raconte l'histoire d'une femme lambda qui décompte le nombre de féminicides en Belgique. Et ça la rend folle. Ce personnage est fictionnel, mais tous les noms des victimes sont réels. Dans la pièce, ils sont repris sur une stèle. Suite aux annulations dues au Covid, on s'est dit qu'on devait agir dans la rue, seul espace accessible puisqu'on était tous confinés. D'autant que les chiffres des violences familiales augmentaient. Alors on a installé une vraie stèle dans l'espace public.La première stèle en mémoire des victimes de féminicides a été dévoilée en 2021 à Tournai (photo). ©Compagnie de la Bête NoireLe monument de Saint-Gilles en suit d'autres.La première stèle est inaugurée en septembre 2021 à Tournai. Puis une autre apparaît à Quaregnon en mars 2023. Elles reprennent chacune 100 noms, à partir du 1er janvier 2017. C'est le moment où j'ai écrit le texte, qui est aussi la date où commence le décompte dans le spectacle. Évidemment, les féminicides ne s'arrêtent jamais. Et iI manquait un tel monument à Bruxelles. Pour le concevoir, nous avons reçu un subside de l'Égalité des Chances et le soutien de la Commune de Saint-Gilles.Pourquoi la place Marie Janson ?La compagnie est à Saint-Gilles. Nous cherchions un lieu de passage, où on peut se rassembler, notamment pour démarrer un événement ou une manifestation. Il ne fallait pas que la stèle soit cachée entre deux rues. De plus, il s'agit d'une des rares places portant le nom d'une femme. Nous sommes donc très heureuses de cette proposition de la Commune. L'emplacement définitif n'est pas encore déterminé, aussi la stèle ne sera-t-elle pas cimentée ce 8 mars. Mais c'est certain : elle sera bien installée place Marie Janson.guillementC'est évidemment très compliqué de quitter un conjoint violent. 9 féminicides sur 10 se déroulent d'ailleurs après une rupture. C'est un \"Tu ne m'échapperas pas\".Céline DelbecqPourquoi cette forme atypique ?C'est la forme qu'elle prend dans le spectacle. Le côté métallique est solide et dentelé. Il liste 50 noms de victimes de féminicides de chaque côté : date, nom, prénom, âge et ville. Mais le socle est nettement plus long : c'est \"la partie manquante\", qui symbolise les victimes qu'on ignore. Car il n'y a aucun recensement officiel en Belgique. J'ai appris depuis la conception qu'on déplorait 3 autres victimes durant l'époque que couvre cette 3e stèle.Les noms sont inscrits sur la partie dentelée. La \"partie manquante\" symbolise les victimes inconnues. ©Compagnie de la Bête NoireExiste-t-il d'autres stèles similaires à l'étranger ?Je ne pense pas mais je ne peux pas l'affirmer. Mon texte est traduit. Il est joué au Mexique pour le moment. La mise en scène là-bas reprend une stèle aux formes identiques. Les comédiens citent aussi les noms des victimes belges.D'où viennent ces noms ?Ce sont les femmes recensées par Stop Féminicide. Parfois, certains noms me posent question. Par exemple, doit-on inclure le nom d'une jeune fille de 14 ans qui s'est suicidée après avoir été violée par 5 hommes à Gand? Doit-on inclure le nom de Néva, bébé de 22 mois battu à mort ? L'homme qui l'a tué, son beau-père, l'aurait-il fait avec un garçonnet ? Dans ce cas précis, il s'agit sans doute d'un féminicide : elle avait subi un viol. C'est la plus jeune victime recensée. Il y a aussi 23 victimes collatérales des féminicides.Qui sont ces \"autres\" victimes ?Par exemple, un homme tué avec sa compagne. Ou le cousin d'une victime : celle-ci avait très peur de mourir, son cousin est venu dormir chez elle pour la rassurer, mais il a aussi été tué par l'ex-compagnon. Il y a encore cette affaire qui concerne Nathalie Maillet et Anne Lawrence Durviaux, toutes deux abattues par le mari de la première. C'est complexe et ça questionne le public car la justice ne se prononce pas à chaque fois. Je reçois d'ailleurs des courriers de personnes mécontentes qui contestent la nature féminicide de certains meurtres.guillementLes parents d'Aude Ledoux, victime, insistent sur le fait que le féminicide est une responsabilité sociétale, et pas familiale. Ils ne supportent plus que soient écrits les termes \"crime passionnel\" pour parler du meurtre de leur fille.Céline DelbecqLa définition c'est \"le meurtre d'une ou plusieurs femmes parce qu'elles sont des femmes\". Pourtant, on ressent encore des réticences à appeler un chat un chat. Dans la presse notamment.C'est ce que racontent les parents d'Aude Ledoux. Son nom est repris sur la stèle de Tournai. Ils ne supportent plus que soient écrits les termes \"crime passionnel\" pour parler du meurtre de leur fille. Leur témoignage est important : ils insistent sur le fait que le féminicide est une responsabilité sociétale, et pas familiale. L'asbl féministe Fem & L.A.W., experte dans le droit des femmes et qu'on a invitée dans le cadre de l'inauguration de la stèle, rappelle que 83 % des violences dans la ville sont exercées par des hommes. Ses expertes notent aussi que le nouvel accord de gouvernement fédéral cite 330 fois le mot \"sécurité\" sans que rien ne soit spécifiquement entrepris pour réduire les violences masculines. On pourrait croire que le nombre d'enfants victimes collatérales des féminicides pourrait sensibiliser davantage sur ce fait sociétal, mais non.D'où vous vient cet engagement artistique sur cette thématique ?Avant \"Cinglée\", j'ai écrit un texte sur le courage d'une femme qui quitte son conjoint violent. Comme tout le monde, je me demandais : \"pourquoi ne partent-elles pas ?\" Je me suis approché de ces raisons par l'écriture. C'est évidemment très compliqué de quitter un conjoint violent. 9 féminicides sur 10 se déroulent d'ailleurs après une rupture. C'est un \"Tu ne m'échapperas pas\". Mais dans le chef des victimes, il y a aussi la difficulté d'abandonner un homme vulnérable, ce qui est le cas de ces hommes violents. J'ai joué ce texte et un jour, un homme m'a reproché : \"Vous n'aimez pas les hommes\".Céline Delbecq écrit essentiellement sur des faits de société. Elle avoue qu'en 2024, elle a davantage fréquenté les tribunaux que les salles de théâtre. ©EdA - Julien RensonnetClassique.Oui ! D'où vient cet amalgame ? Pourquoi certains ne veulent-ils pas voir ? Il y a de quoi devenir cinglée. De là est venu le texte suivant. Je garde cette naïveté qu'en partageant ce que je sais, je peux avoir un impact.guillementOn pourrait croire que le nombre d'enfants victimes collatérales des féminicides pourrait sensibiliser davantage sur ce fait sociétal, mais non.Céline DelbecqAvez-vous des contacts avec les familles de victimes ?Avec certaines, oui. Elles sont reconnaissantes. Comme la grand-mère de Néva, cette fillette de 22 mois, ou la sœur de Sara Giordano, assassinée avec ses deux enfants, Emmy et Marty. Ces personnes sont hyper contentes. Ma terreur, c'est la réaction des familles. Car les noms restent sur les monuments. Par exemple, on n'y a pas gravé celui d'une femme saint-gilloise dont la famille refuse d'entendre parler de féminicide. Elle était pourtant violentée depuis des années. Mais je ne voudrais pas leur imposer de voir le nom à chaque fois qu'ils passent devant la stèle.L'inauguration est aussi l'occasion d'une visite d'audience lors d'un procès pour féminicide : jugez-vous important que le public y assiste ?L'an dernier, je me suis rendu compte que je n'allais plus au théâtre, mais uniquement au Palais de Justice. J'ai assisté à pas mal de procès avec la Ligue des Droits Humains. Aux assises, en correctionnelle, au tribunal de la jeunesse. Ça me passionne. C'est important aussi de décrypter les termes qui sont employés, ce que fait la Ligue. Ces visites m'ont rendu l'espoir, car il y a beaucoup d'humanisme dans ces procès. Ce sont des combats pour que les gens s'en sortent, notamment au tribunal de la jeunesse.Vous êtes donc habituée des procès.Ce goût m'est venu via Julie Bernier, l'ancienne procureure de Montluçon, en France. J'y suis artiste associée au centre dramatique national. Elle avait notamment instauré des téléphones au bénéfice des femmes \"en grave danger\". Mais ne disposait que de trois appareils. Quand elle jugeait l'urgence moins préoccupante dans une affaire plutôt qu'une autre, elle devait transférer le téléphone et ça la mettait dans une position très précaire. Elle se demandait plus généralement comment sensibiliser le public. La justice, ça fait un peu peur, avec son jargon et ses vastes couloirs, mais c'est un des piliers de la démocratie.\"Il y a trop d'extrême violence à l'égard des travailleuses du sexe\": la rue Eunice Osayande, prostituée assassinée, \"rappellera leurs vulnérabilités\" L'Amazone, les féministes qui s'y collent pour dénoncer les féminicides: \"Tout est toujours circonstances atténuantes pour les hommes\" En 1976, Bruxelles a eu son #MeToo : 3 militantes se souviennent du Tribunal International des Crimes contre les Femmes et ses 2.000 participantes + Vous êtes victime ou témoin de violence familiale ou de genre? Un N° existe en Belgique: le 0800\/30.030. Plus d'info sur le site Écoute Violences Conjugales. ©Compagnie de la Bête Noire \/ Commune de Saint-Gilles+ Inauguration de la stèle aux victimes de féminicide, ce samedi 8 mars 2025 à 13h, place Marie Janson à Saint-Gilles. + Dans le cadre de cet événement, lecture-performance de \"Cinglée\" de et par Céline Delbecq à la Tricoterie (19h), suivie d'une rencontre avec Aline Dirk (Stop Féminicide) et l'essayiste féministe Valérie Rey-Robert. Le 7 mars au Jacques Franck (15h30): \"Les yeux noirs\" de Céline Delbecq. 10 et 11 mars: visites d'audience au Justitia avec la Ligue des Droits Humains (complet).","Description":"C'est une première à Bruxelles : une stèle en mémoire des victimes de féminicides va être installée à Saint-Gilles. Nathalie, Sara, Néva… : elle porte les noms de 100 femmes. Céline Delbecq, son initiatrice, raconte la genèse de ce monument et son travail pour visibiliser les féminicides. \"Ils relèvent d'une responsabilité sociétale, et pas familiale\".","Feed":"AVENIR"},{"Title":"L’agriculteur qui a étouffé ses deux filles de 5 à 8 ans à Oostkamp condamné pour avoir harcelé son ex-femme","Date":1743600240000,"Day":2.0,"Month":4.0,"Year":2025.0,"Hour":"13:24","URL":"https:\/\/www.7sur7.be\/faits-divers\/lagriculteur-qui-a-etouffe-ses-deux-filles-de-5-a-8-ans-a-oostkamp-condamne-pour-avoir-harcele-son-ex-femme~abc15696\/","Description_all":"La cour d’appel de Gand a condamné mercredi un agriculteur qui avait étouffé ses deux filles il y a deux ans à huit mois de prison pour le harcèlement de son ex-femme. Il avait en effet continué à lui envoyer des lettres et à l’appeler régulièrement depuis la prison.","Description":"La cour d’appel de Gand a condamné mercredi un agriculteur qui avait étouffé ses deux","Feed":"7sur7 : faits-divers"}]